% определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

mrg([], [], _).
mrg(L1, [], L1).
mrg([], L2, L2).
mrg([H1|T1], [H2|T2], [H1|T]) :- H1 =< H2, mrg(T1, [H2|T2], T).
mrg([H1|T1], [H2|T2], [H2|T]) :- H2 <  H1, mrg([H1|T1], T2, T).

/*
swipl .\5_merge.pl

?- mrg([1,2,3], [4,5,6], [1,2,3,4,5,6]).
true .

?- mrg([1,2,3], [4,5,6], [4,5,6,1,2,3]).
false.

?- mrg([1,2,3], [4,5,6], [6,5,4,3,2,1]).
false.

?- mrg([1,2,3], [4,5,6], R).
R = [1, 2, 3, 4, 5, 6] .

?- mrg([1,2,3], [], R).
R = [1, 2, 3] .

?- mrg([], [1, 2, 3], R).
R = [1, 2, 3] .

*/
